# Core
brew "git"
brew "gnupg"

# Shell tools
brew "wget"
brew "curl"
brew "jq"
brew "yq"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "tree"

# Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Fonts
cask "font-fira-code"
cask "font-lxgw-wenkai"
