# Core
brew "git"
brew "gnupg"
brew "zsh"

# Shell tools
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "wget"
brew "curl"
brew "jq"
brew "yq"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "tree"
brew "htop"
brew "tmux"

# Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Node
brew "nvm"
